// Ordinarily, you'd generate this data from markdown files in your
// repo, or fetch them from a database of some kind. But in order to
// avoid unnecessary dependencies in the starter template, and in the
// service of obviousness, we're just going to leave it here.

// This file is called `_posts.js` rather than `posts.js`, because
// we don't want to create an `/blog/posts` route — the leading
// underscore tells Sapper not to do that.

const posts = [
  {
    title: 'เปิดตัว "เก็บไว้" แชทบอทช่วยเก็บไฟล์ในไลน์โดยอัตโนมัติ',
    preview_content:
      'เปิดตัว "เก็บไว้" แชทบอทช่วยเก็บไฟล์ในไลน์โดยอัตโนมัติ ไม่ต้องกังวลว่าไฟล์ในไลน์จะหมดอายุ หรือหาไม่เจออีกต่อไป. ทุกวันนี้ใครๆ ก็เล่น Line กันหมดใช่ไหมคะ? เพราะใช้งานได้ง่าย สะดวก และรวดเร็ว. นอกจากเราจะใช้ Line เพื่อคุยกับเพื่อนหรือครอบครัวแล้ว หลายๆ คนก็ใช้คุยงานต่างๆ รวมถึงการส่งไฟล์ให้กัน ไม่ว่าจะเป็นเอกสาร หรือรูปภาพ...',
    preview_image:
      "https://ik.imagekit.io/tqbc8pye197/webapp/blog-preview-1.png?tr=q-50",
    slug: "introducing-gebwai",
    html: `
					<div class="inner-banner pt-29 pt-lg-30 pb-9 pb-lg-12 bg-default-6">
						<div class="container">
							<div class="row  justify-content-center pt-5">
								<div class="col-xl-8 col-lg-9">
									<div class="px-md-15 text-center">
									<h2 class="gr-text-4 mb-9">เปิดตัว "เก็บไว้" แชทบอทช่วยเก็บไฟล์ในไลน์โดยอัตโนมัติ ไม่ต้องกังวลว่าไฟล์ในไลน์จะหมดอายุ หรือหาไม่เจออีกต่อไป</h2>
									<p class="gr-text-8 mb-0 mb-lg-13">25 มกราคม 2564 - ใช้เวลาอ่าน 5 นาที</p>
									</div>
								</div>
							</div>
						</div>
					</div>

					<div class="main-block pb-6 pb-lg-17 bg-default-6">
					<div class="container">
						<div class="row justify-content-center">
							<div class="col-xl-8 col-lg-9">

								<div class="single-block mb-12 mb-lg-15">
									<p class="gr-text-9 mb-9">ทุกวันนี้ใครๆ ก็เล่น Line กันหมดใช่ไหมคะ? เพราะใช้งานได้ง่าย สะดวก และรวดเร็ว. นอกจากเราจะใช้ Line เพื่อคุยกับเพื่อนหรือครอบครัวแล้ว หลายๆ คนก็ใช้คุยงานต่างๆ รวมถึงการส่งไฟล์ให้กัน ไม่ว่าจะเป็นเอกสาร หรือรูปภาพ. ส่วนพ่อแม่ค้าออนไลน์ อาจจะใช้ไลน์ในการคุยกับลูกค้า รวมถึงรับสลิปโอนเงินจากลูกค้า เป็นต้น</p>
									<p class="gr-text-9 mb-9">แต่ได้ยินมาว่าหลายๆ คน เจอปัญหาไฟล์ในไลน์หมดอายุ เปิดไฟล์ไม่ได้ จะขอให้ช่วยส่งไฟล์มาให้อีกครั้ง ก็ไม่กล้ารบกวน เลยต้องพยายามหาวิธีแก้ไข สุดท้ายก็ยังไม่เจอ เอาล่ะ...คงต้องกลั้นใจรบกวนไปสักครั้ง ฮึบ...!!</p>
									<p class="gr-text-9 mb-9">"ต่อไปคงต้องเซฟไว้ในเครื่องแล้วล่ะ.." เวลาอยากย้อนกลับไปดู ก็ยังต้องเสียเวลาหาอยู่ดี เพราะไฟล์เยอะไปหมด
										รูปในเครื่องก็เยอะอยู่แล้ว เซฟไฟล์เยอะๆ อีก เม็มเครื่องคงเต็มแน่ๆ เลย
										บางครั้งก็ลืมเซฟ เพราะกำลังเร่งรีบทำอย่างอื่นอยู่ (แหม จะให้คอยเซฟทุกอย่างก็ไม่ไหวหรอกใช่ไหมล่ะ)
										บางทีก็อาจจะคิดว่าไฟล์นี้คงใช้แค่ครั้งนี้ครั้งเดียวแหละ ไม่ต้องเซฟหรอก (อ้าว...อยู่ดีๆ ต้องใช้ซะงั้น แต่หมดอายุไปซะแล้ว)</p>
									<p class="gr-text-9 mb-9">เพราะบางครั้ง ปัญหาที่คาดไม่ถึง อาจจะมากกว่าที่เราคิด. ทีมงาน Codustry เลยพัฒนาน้อง "เก็บไว้" มาแก้ปัญหาเหล่านี้. นอกจาก "เก็บไว้" จะช่วยแก้ปัญหาสุดกวนใจเหล่านี้แล้ว ยังช่วยให้เราทำงานได้อย่างมีประสิทธิภาพมากขึ้นด้วยนะ เพราะสามารถส่งไฟล์ต่างๆ ไว้ในไลน์ได้เลย ไม่ต้องไปหาที่ฝากไฟล์ หรือส่งผ่านอีเมลให้ยุ่งยาก และที่สำคัญ คือ ประหยัดเวลามาก ให้แชทบอทช่วยเซฟไฟล์ต่างๆ แทน เพื่อให้คุณมีเวลาไปทำงานส่วนอื่น หรือพักผ่อนตามต้องการ</p>
								</div>

								<div class="single-block mb-12 mb-lg-15">
									<h3 class="gr-text-6 font-weight-bold mb-9">"เก็บไว้" ทำอะไรได้บ้าง?</h3>
									<p class="gr-text-9 mb-9">1. ช่วยเก็บไฟล์ที่ส่งกันในไลน์ ไว้บนคลาวด์อย่าง Google Drive โดยอัตโนมัติ ไม่ต้องคอยเซฟเอง</p>
									<p class="gr-text-9 mb-9">2. รวบรวมไฟล์ไว้ที่เดียว อยากหาไฟล์ประเภทไหน หรือไฟล์จากใคร ก็เข้าโฟลเดอร์นั้นๆ เลย</p>
									<p class="gr-text-9 mb-9">3. จัดระเบียบโฟลเดอร์ ให้หาง่ายยิ่งขึ้น ประหยัดเวลาด้วย (มีโฟลเดอร์สำหรับสลิปโอนเงินแยกไว้ด้วยนะ สำหรับใครที่ต้องดูสลิปเยอะๆ ไม่ต้องเสียเวลางมหาเลย)</p>
									<p class="gr-text-9 mb-9">ฟีเจอร์ของ "เก็บไว้" ยังไม่หมดเพียงเท่านี้ เรากำลังพัฒนาฟีเจอร์ใหม่ๆ ให้ "เก็บไว้" ต่อไปเรื่อยๆ รับรองว่าโดนใจผู้ใช้งานแน่นอน</p>
								</div>

								<div class="single-block mb-12 mb-lg-15">
									<h3 class="gr-text-6 font-weight-bold mb-9">รีวิวการใช้งาน</h3>
									<p class="gr-text-9 mb-9">จากที่ทีมงานลองใช้ดูแล้ว ถือว่าแชทบอทนี้ช่วยให้เราใช้ไลน์ได้อย่างมีประสิทธิภาพมากยิ่งขึ้นเลยทีเดียว จะส่งไฟล์อะไรก็ไม่ต้องกังวลว่าไฟล์จะหมดอายุ แถมยังช่วยให้เราหาไฟล์ที่ต้องการได้รวดเร็วขึ้น เพราะไฟล์ได้รับการจัดอย่างเป็นระเบียบและรวบรวมไว้ในที่เดียว ฟีเจอร์เด่นๆ คือ มีโฟลเดอร์สลิปโอนเงินแยกไว้ต่างหาก เหมาะมากสำหรับเหล่าพ่อค้าแม่ค้าออนไลน์ หรือใครก็ตามที่ต้องคอยจัดการกับสลิปโอนเงินเยอะๆ นอกจากนี้ ยังสามารถแชร์ link ให้คนอื่นสามารถเข้ามาดูไฟล์ต่างๆ ได้ง่ายมาก ไม่ต้องคอยส่งไฟล์ซ้ำๆ ไปใหม่เลย ที่สำคัญมาก "เก็บไว้" ทำตามพรบ.คุ้มครองข้อมูลส่วนบุคคล ไม่มีการเก็บข้อมูลใดๆ ไว้ที่เซอร์เวอร์ของ "เก็บไว้" เลย แต่จะอัพโหลดขึ้นบนคลาวด์อย่างเช่น Google Drive ได้โดยตรง ไว้ใจได้เลยค่ะ</p>
								</div>

								<div class="single-block mb-12 mb-lg-15">
									<h3 class="gr-text-6 font-weight-bold mb-9">เริ่มต้นใช้งาน</h3>
									<p class="gr-text-9 mb-9">1. แอดไลน์ได้ที่ <a href="https://lin.ee/BJ4dbWO" target="_blank">https://lin.ee/BJ4dbWO</a></p>
									<p class="gr-text-9 mb-9">2. เชื่อมต่อบัญชีคลาวด์ เช่น Google Drive</p>
									<p class="gr-text-9 mb-9">3. ชวน "เก็บไว้" เข้าแชทที่ต้องการให้เก็บไฟล์</p>
									<p class="gr-text-9 mb-9">4. เมื่อส่งไฟล์ที่มี "เก็บไว้" อยู่ในแชท "เก็บไว้" จะทำการเซฟไฟล์ไว้ที่คลาวด์โดยอัตโนมัติ</p>
								</div>

								<a rel="prefetch" href="blog/" class="btn-link with-icon gr-text-blue gr-text-9 font-weight-bold mt-10"><i class="fas fa-arrow-left"></i>&nbsp;&nbsp; กลับหน้าบล็อก</a>

							</div>
						</div>
					</div>
				</div>
			`,
  },
];

posts.forEach((post) => {
  post.html = post.html.replace(/^\t{3}/gm, "");
});

export default posts;
